Revit 2024 API
BuiltInFailures.StairRampFailures.CannotPlaceBalusterOffset Property
 Can't place Balusters and/or Rails with desired offset
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPlaceBalusterOffset { get; }
Visual Basic
Public Shared ReadOnly Property CannotPlaceBalusterOffset As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPlaceBalusterOffset {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace